wiciu15/NRF51_CAN_BLE_HID_Multimedia/src/main.c
static void start_playing_after_connect_timeout(void * p_context){
	hid_multimedia_send_key(MEDIA_PLAY);
}

static void blink_led_on(void * p_context){
	nrf_gpio_pin_set(ONBOARD_LED_PIN);
}

static void blink_adv_toggle(void * p_context){
	LED_blink();
}

static void hold_to_erase_bonds_handler(void * p_context){

	ret_code_t           err_code;

	NRF_LOG_INFO("BLE disconnect\r\n");
	if(ble_conn_state_status(m_conn_handle)==BLE_CONN_STATUS_CONNECTED){
		err_code = sd_ble_gap_disconnect(m_conn_handle,BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
	}

	NRF_LOG_INFO("Delete all peers from device manager\r\n");
	err_code = pm_peers_delete();
	APP_ERROR_CHECK(err_code);

	NRF_LOG_INFO("Issue NVIC_SystemReset() to reboot\r\n");
	__disable_irq();
	NVIC_SystemReset();
}

static void steering_wheel_debounce_handler(void * p_context){
	inhibit_button_press=0;
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module, making it use the scheduler.
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, true);

    // Create battery timer.
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    err_code = app_timer_create(&m_key_release_interval_id,APP_TIMER_MODE_SINGLE_SHOT,key_release_timer_timeout_handler);
    err_code = app_timer_create(&m_sleep_delay_timer_id,APP_TIMER_MODE_SINGLE_SHOT,sleep_delay_timer_timeout_handler);
    err_code = app_timer_create(&m_start_playing_timer_id,APP_TIMER_MODE_SINGLE_SHOT,start_playing_after_connect_timeout);
    nrf_gpio_cfg_output(ONBOARD_LED_PIN); //blink led output
    nrf_gpio_pin_set(ONBOARD_LED_PIN);
    err_code = app_timer_create(&m_blink,APP_TIMER_MODE_SINGLE_SHOT,blink_led_on);
    err_code = app_timer_create(&m_adv_blink,APP_TIMER_MODE_REPEATED,blink_adv_toggle);
    err_code = app_timer_create(&m_hold_to_erase_bonds_timer,APP_TIMER_MODE_SINGLE_SHOT,hold_to_erase_bonds_handler);
    err_code = app_timer_create(&m_steering_wheel_switch_debounce_timer,APP_TIMER_MODE_SINGLE_SHOT,steering_wheel_debounce_handler);
    APP_ERROR_CHECK(err_code);


}

/**@brief Handler for ext interrupt from button on PCB
 *
 * @details This function clears bonding data and resets the MCU on PCB button press
 */
static void bonds_reset_button_int_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action){
	hold_to_erase_bonds_handler(NULL);
}

/**@brief Handler for MCP2515 INT pin external interrupt
 *
 * @details This function reads can frame from MCP2515 RX buffer and triggers appropriate action based on can frame data
 */
static void mcp2515_int_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action){
	mcp2515_rx(&received_can_frame);
	NRF_LOG_INFO("CAN RX id%X data0x%X \r\n",received_can_frame.can_id&CAN_EFF_MASK,(received_can_frame.data[0]))
	LED_blink();
	if(inhibit_button_press==0){
		inhibit_button_press=1;
		app_timer_start(m_steering_wheel_switch_debounce_timer,DEBOUNCE_DELAY,NULL);
		switch(received_can_frame.data[0]){
		case CAN_MEDIA_ALL_RELEASED :
			app_timer_stop(m_hold_to_erase_bonds_timer);
			break;
		case CAN_MEDIA_MUTE :
			app_timer_start(m_hold_to_erase_bonds_timer,HOLD_TO_ERASE_BONDS_DELAY,NULL);
			break;
		}
		//if connected to phone start controlling media
		if(ble_conn_state_status(m_conn_handle)==BLE_CONN_STATUS_CONNECTED){
			switch(received_can_frame.data[0]){
			case CAN_MEDIA_NEXT :
				hid_multimedia_send_key(MEDIA_NEXT);
				break;
			case CAN_MEDIA_PREV :
				hid_multimedia_send_key(MEDIA_PREV);
				break;
			case CAN_MEDIA_MUTE :
				hid_multimedia_send_key(MEDIA_STOP);
				break;
			default:
				break;
			}
		}
	}else{
		NRF_LOG_INFO("BUTTON DEBOUNCED");
	}
}

/**@brief Function for GPIOTE and interrupt pins configuration.
 *
 * @details This function sets up GPIOTE peripheral and configures interrupt pin for use with MCP2515
 */
static void gpiote_init(void){
	ret_code_t err_code;

	err_code = nrf_drv_gpiote_init();
	APP_ERROR_CHECK(err_code);

	nrf_drv_gpiote_in_config_t clear_bonds_and_reset_button_config = GPIOTE_CONFIG_IN_SENSE_LOTOHI(true);
	clear_bonds_and_reset_button_config.pull = NRF_GPIO_PIN_PULLDOWN;

	nrf_drv_gpiote_in_config_t mcp2515_int_pin_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(true);
	mcp2515_int_pin_config.pull = NRF_GPIO_PIN_PULLUP;

	err_code = nrf_drv_gpiote_in_init(RESET_BONDS_BUTTON_PIN, &clear_bonds_and_reset_button_config, bonds_reset_button_int_handler);
	err_code = nrf_drv_gpiote_in_init(MCP2515_INT_PIN, &mcp2515_int_pin_config, mcp2515_int_pin_handler);
	APP_ERROR_CHECK(err_code);

	nrf_drv_gpiote_in_event_enable(MCP2515_INT_PIN, true);
	nrf_drv_gpiote_in_event_enable(RESET_BONDS_BUTTON_PIN, true);
}
/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HID_KEYBOARD);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


